driver-tests/bpelse/correlation/CorrelationOnePropJBI/test/Invoke_Pick_InitNo/Input1.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
                   xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance"
                   xmlns:xsd="http://www.w3.org/1999/XMLSchema"
                   xmlns:tns="http://seebeyond.com/correlation/"
                   xmlns="Parent">
 <SOAP-ENV:Header/>
 <SOAP-ENV:Body>
 <ParentOperation>
    <ParentPart>
       <ParentElement>
          <string>Test Message</string>
       </ParentElement>
    </ParentPart>
 </ParentOperation>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>