driver-tests/bpelse/samples/samplesJBI/test/subBP/Input.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
        xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance" 
        xmlns:xsd="http://www.w3.org/1999/XMLSchema"
        xmlns="Parent"> 
    <SOAP-ENV:Header />
    <SOAP-ENV:Body> 
        <ParentOperation>
            <ParentPart>
                <ParentElement xmlns="Parent">
                    <string>b1</string>
                </ParentElement>
            </ParentPart>
        </ParentOperation>
    </SOAP-ENV:Body> 
</SOAP-ENV:Envelope> 